Revit 2026 API

# ProjectPosition(ProjectPosition) Constructor

---

Creates a copy of the ProjectPosition.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ProjectPosition(
	ProjectPosition other
)
```
```vb
Public Sub New (
	other As ProjectPosition
)
```
```cpp
public:
ProjectPosition(
	ProjectPosition^ other
)
```
```fsharp
new :
        other : ProjectPosition -> ProjectPosition
```

#### Parameters

other ProjectPosition

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ProjectPosition Class

ProjectPosition Overload

Autodesk.Revit.DB Namespace